# GetName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..GetName Method
ScheduleField Class See Also
---
Gets the name of the field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string GetName()
```

Visual Basic
---
```text
Public Function GetName As String
```

Visual C++
---
```text
public:
String^ GetName()
```

# ### Return Value
The name of the field.
# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace